benchmarks/results/20260730_m2_ab_rep2/after_proxyx.txt
Running 20s test @ http://127.0.0.1:18099/proxy/x
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.43ms   64.86ms 602.09ms   85.15%
    Req/Sec    14.43k     3.42k   27.77k    75.75%
  Latency Distribution
     50%    1.18ms
     75%   21.14ms
     90%  133.13ms
     99%  201.51ms
  574784 requests in 20.08s, 197.88MB read
  Non-2xx or 3xx responses: 574784
Requests/sec:  28622.93
Transfer/sec:      9.85MB